Repository: 84000/data-translation-memory
Catalog: Toh_96-The_Miraculous_Play_of_Manjusri-v2.tmx
Source language: bo
Languages: en

source: འཕགས་པ་འཇམ་དཔལ་རྣམ་པར་རོལ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra The Miraculous Play of Mañjuśrī

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisatvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་དགེ་སློང་ལྔ་བརྒྱ་ཙམ་གྱི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་སྟོང་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ
en: Once, the Blessed One was staying at Vulture Peak in Rājagṛha with a great community of some five hundred monks, and with eight thousand bodhisatvas.

source: དེའི་ཚེ་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ན་སྨད་འཚོང་མའི་བུ་མོ་གསེར་མཆོག་འོད་དཔལ་ཞེས་བྱ་བ་གཟུགས་བཟང་ཞིང་མཛེས་ལ་བལྟ་ན་སྡུག་པ།
en: At that time, a courtesan’s daughter, Suvarṇottama­prabhāśrī, who was beautiful, charming, and attractive, was living in the great city of Rājagṛha.

source: ཁ་དོག་བཟང་པོ་རྒྱས་པ་མཆོག་དང་ལྡན་པ་ཞིག་འདུག་སྟེ
en: Her beautiful complexion was the most abundant of her riches.

source: བུ་མོ་དེ་ཡང་སྔོན་གྱི་དགེ་བའི་རྩ་བའི་རྒྱུས་ལུས་ཀྱི་མདོག་གསེར་གྱི་ཁ་དོག་ལྟ་བུར་མངོན་པར་གྲུབ་པར་གྱུར་ཅིང་། སའི་ཕྱོགས་གང་དུ་འགྲེང་བ་དང་། འདུག་པ་དང་། འགྲོ་བའི་ས་ཕྱོགས་དེ་དག་ཀྱང་གསེར་གྱི་ཁ་དོག་ལྟ་བུའི་འོད་ཀྱིས་སྣང་བར་གྱུར་ཏེ
en: Because of the roots of virtue she had previously developed, that girl, whose body was the color of gold, was illumined by a light of a similar golden color wherever she stood, sat, or walked.

source: དེས་གོས་དམར་པོའམ། དཀར་པོའམ། གང་དག་གྱོན་པར་གྱུར་པའི་གོས་དེ་དག་ཐམས་ཅད་ཀྱང་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་ཉིད་དུ་ཀུན་དུ་སྣང་ངོ་། །
en: Whatever clothes she put on, whether they were red or white, would shine with precisely the same golden color.

source: བུ་མོ་དེ་ཡང་སྐྱེ་བོའི་ཚོགས་ཐམས་ཅད་ལ་དགའ་ཞིང་ཡིད་གཅུགས་པ་དང་། ལྟ་བས་མི་ངོམས་ཤིང་
en: That girl was a beloved and comforting friend to all people, and they never tired of looking at her.

source: བཀའ་བློ་བདེ་ལ་དེས་པ་དང་། འཇམ་པ་དང་། སྙན་པ་དང་། དགའ་བ་སྨྲ་ཞིང་བཞིན་འཛུམ་པ་དང་། ཤིན་ཏུ་འཐུན་པར་འཛིན་པ་དང་། ཁྲོ་གཉེར་མེད་པ་དང་།
en: She had such gentle speech—tender, soft, sweet, and pleasant—and her ever-smiling face, never bunched up in anger, won the respect of all.

source: མི་རྩུབ་པ་དང་། མི་བརླང་བར་གྱུར་པས་
en: There was no harshness or roughness in her.

source: རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་དེ་ན་རྒྱལ་བུ་གཞོན་ནུ་རྣམས་དང་། བློན་པོའི་བུ་གཞོན་ནུ་རྣམས་དང་། ཚོང་དཔོན་གྱི་བུ་གཞོན་ནུ་རྣམས་དང་། ཁྱིམ་བདག་གི་བུ་གང་ཇི་སྙེད་པ་དེ་དག་ཀྱང་དེ་ལ་ཤིན་ཏུ་ཆགས་ཤིང་
en: All the young princes, the young sons of ministers, the young sons of bankers, and the young sons of householders in the great city of Rājagṛha desired her greatly.

source: ཡིད་འབྲང་བར་གྱུར་ཏེ་ལྟ་བས་ཆོག་མི་ཤེས་སོ། །
en: She was always in their thoughts, and no matter how much they saw of her, they were never satisfied.

source: སྨད་འཚོང་མའི་བུ་མོ་གསེར་མཆོག་འོད་དཔལ་དེ་སྐྱེད་མོས་ཚལ་ལམ། འབབ་ཆུའམ། རྫིང་བུའམ། ཁྱིམ་འམ། ལམ་པོ་ཆེའམ། གྲོང་བར་རམ། གང་དང་གང་དུ་འགྲོ་བ་དེ་དང་དེ་དག་ཏུ་སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་མང་པོ་རྣམས་ཀྱང་ཤིན་ཏུ་ལྟད་མོར་གྱུར་ནས་ཀུན་འདུས་ཏེ་ དེའི་ཕྱི་བཞིན་འབྲང་ཞིང་འགྲོའོ། །
en: Wherever that courtesan’s daughter Suvarṇottama­prabhāśrī went—to gardens, to rivers, to lotus ponds, to houses, to boulevards, or to marketplaces—men, women, boys, and girls assembled and followed her out of curiosity.

source: དེ་ནས་སྨད་འཚོང་མའི་བུ་མོ་གསེར་མཆོག་འོད་དཔལ་དེ་ཚོང་དཔོན་གྱི་བུ་འཇིགས་བྱིན་ཞེས་བྱ་བས་ནོར་གྱིས་གླས་ཏེ།
en: One day, a banker’s son named Bhayadatta used some of his wealth to hire the courtesan's daughter, Suvarṇottama­prabhāśrī.

source: སྐྱེད་མོས་ཚལ་གྱི་སར་བྱུང་ནས་
en: Setting out for a garden,

source: རྟ་བཞི་དང་ལྡན་པའི་ཤིང་རྟ་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་དཱུརྱ་དང་། གསེར་གྱིས་ལེགས་པར་བརྒྱན་པ། གདུགས་དང་རྒྱལ་མཚན་དང་། བ་དན་བསྒྲེང་ཞིང་
en: they sat down on a pleasant seat that had been prepared for them in a carriage drawn by four horses, which was decorated with jewels, pearls, cat’s eye gems, and gold, with raised parasols, flags, and banners.

source: མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྱེ་མ་དང་། མེ་ཏོག་ཕྲེང་གིས་མཛེས་བྱས་པ། མེ་ཏོག་ཙམ་པ་ཀའི་ཕྲེང་བས་སྐར་ཁུང་བྱས་པའི་ནང་དུ་སྟན་བཟང་པོ་བཤམས་པ་ལ་འདུག་ནས
en: It was adorned with flowers, incense, perfume, aromatic powder, and garlands, and its windows were adorned with campaka flowers.

source: འདི་ལྟར་རྩེ་ཞིང་དགའ་བའི་བསམ་པས་ཤིང་རྟ་དེའི་མདུན་དུ་ནི་སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་དང་། གླུ་དབྱངས་ལེན་པ་དག་གིས་དྲངས། ཤིང་རྟ་དེའི་ཕྱི་བཞིན་དུ་ནི་ཉེ་བར་སྤྱད་པ་དང་། ཡོངས་སུ་སྤྱད་པ་ཐོགས་པ་ཐམས་ཅད་རྗེས་སུ་འབྲང་ལ།
en: The carriage was drawn along by people in front whose thoughts were devoted only to playing around and having fun, accompanied by cymbals and drums, and everyone behind it carried all kinds of things for enjoyment and pleasure.

source: སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་ལྟད་མོ་ལྟ་བའི་བསམ་པ་ཅན་དག་ཀྱང་ཕྱི་བཞིན་འབྲང་བར་གྱུར་ཅིང་སྐྱེད་མོས་ཚལ་གྱི་སར་དོང་ངོ་། །
en: A great crowd of people followed, intent on seeing the woman who so aroused their curiosity, and thus they arrived in the garden.

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ནང་དུ་ཡང་དག་འཇོག་ལས་ལངས་ཏེ།
en: It was at this time that the princely Mañjuśrī emerged from his meditative absorption.

source: སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཆེན་པོ་སྐྱེས་ནས་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Feeling great compassion for all living beings, he thought,

source: སུ་ཞིག་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་ལམ། ཀུན་བརྗོད་པའི་ཆོ་འཕྲུལ་ལམ། རྗེས་སུ་བསྟན་པའི་ཆོ་འཕྲུལ་གྱིས་འདུལ་བར་འགྱུར་བའི་སེམས་ཅན་གང་ཐེག་པ་ཆེན་པོ་འདི་ལ་ཡོངས་སུ་སྨིན་པར་བྱ་སྙམ་པ་དང་།
en: “Who are the living beings, suitable for training, who can be brought to maturity in this Great Vehicle by means of miraculous displays, the miracle of teachings, or the miracle of admonition?”

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་སྨད་འཚོང་མའི་བུ་མོ་གསེར་མཆོག་འོད་དཔལ་ཚོང་དཔོན་གྱི་བུ་འཇིགས་བྱིན་དང་ལྷན་ཅིག་ཏུ་ཤིང་རྟ་ལ་ཞོན་ཏེ་སྐྱེད་མོས་ཚལ་གྱི་སར་འགྲོ་བ་མཐོང་ངོ་། །
en: The princely Mañjuśrī saw the courtesan’s daughter Suvarṇottama­prabhāśrī riding in the carriage with the banker’s son Bhayadatta toward the park.

source: མཐོང་ནས་ཀྱང་གདུལ་བའི་ཕྱིར་དེའི་དབང་པོ་དང་། སྟོབས་དང་བརྩོན་འགྲུས་ཀྱི་བྱེ་བྲག་ལ་རྣམ་པར་བལྟས་ན་དེ་སྔོན་གྱི་དགེ་བའི་རྩ་བ་དང་ལྡན་ཞིང་ཆོས་ཀུན་ཤེས་པར་བྱ་བའི་ནུས་པ་དང་། མཐུ་དང་། སྐལ་བ་ཡོད་པར་རིག་ནས
en: When he saw her, he considered how strong and vigorous she was with regard to her readiness to be trained, and he became aware that she possessed the power of the roots of virtue she had previously developed and the capacity to understand the teachings.

source: དེའི་ཚེ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་ལྟ་བུ་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་འདུ་བྱས་ཏེ། ཇི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱས་པས། འདི་ལྟར་རང་གི་ལུས་བསྟན་མ་ཐག་ཏུ་ཉི་མ་དང་ཟླ་བའི་འོད་ཀྱང་ཟིལ་དུ་རླག་པར་བྱེད་ན། སེམས་ཅན་གཞན་དག་གི་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་པ་
en: So the princely Mañjuśrī produced a miraculous display, a miracle by means of which, as soon as he showed himself, he would outshine even the light of the sun and moon, let alone other sentient beings.

source: དེ་ལྟ་བུར་རང་གི་ལུས་མངོན་པར་སྤྲུལ་ནས།
en: Revealing just such an embodiment,

source: གོས་གང་གི་འོད་ཀྱིས་དཔག་ཚད་གཅིག་ཙམ་གྱི་ཁོར་ཡུག་སྣང་བས་སྣང་བར་བྱེད་པའི་གོས་དེ་ལྟ་བུ་ཡང་ལུས་ལ་གྱོན་པར་ཀུན་དུ་བསྟན་ཏོ། རང་གི་ལུས་རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པར་ཡང་བསྟན་ཏོ། །
en: he appeared clad in all kinds of jewelry and a luminous garment, the luster of which lit up a circular area a yojana across.

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ལུས་ལ་གོས་དང་རྒྱན་ཐམས་ཅད་ཀྱིས་ལེགས་པར་བརྒྱན་ནས་ལམ་གང་ནས་སྨད་འཚོང་མའི་བུ་མོ་གསེར་མཆོག་འོད་དཔལ་འོང་བའི་ལམ་དེའི་མདུན་ལོགས་སུ་བསྡད་དོ། །
en: Then the princely Mañjuśrī, clothed in that garment and adorned with all that jewelry, placed himself facing the road on which the courtesan’s daughter Suvarṇottama­prabhāśrī was traveling.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་དེར་བསྡད་མ་ཐག་ཏུ་དེ་ནས་ཚོང་དཔོན་གྱི་བུ་དེའི་ཤིང་རྟ་ཡང་མོག་མོག་པོར་གྱུར། སྨད་འཚོང་མའི་བུ་མོ་གསེར་མཆོག་འོད་དཔལ་གྱི་ལུས་ཐམས་ཅད་ཀྱང་མོག་མོག་པོར་གྱུར་ཏོ། །
en: As soon as the princely Mañjuśrī had placed himself there, the carriage belonging to the banker’s son was darkened, as was the whole of the courtesan’s daughter Suvarṇottama­prabhāśrī’s body.

source: འདི་ལྟ་སྟེ་དཔེར་ན། འཛམ་བུའི་ཆུ་བོའི་གསེར་གྱི་དྲུང་དུ། སྣག་ཚའི་ཡུག་བཞག་ན་ལམ་མེར་མི་འདུག །ལྷན་ནེར་མི་འདུག །ལྷང་ངེར་མི་འདུག་གོ། །
en: Just as a piece of cloth soaked with ink would not shine, would not be bright, and would not be radiant if one were to place it next to gold from the Jambu River,

source: དེ་བཞིན་དུ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་ལུས་ཀྱི་འོད་ཀྱིས་རེག་པ་ན་བུ་མོ་དེའི་ལུས་ཀྱང་ལམ་མེར་མི་འདུག །ལྷན་ནེར་མི་འདུག །ལྷང་ངེར་མི་འདུག་གོ། །
en: in the same way the girl’s body did not shine, was not bright, and was not radiant when the light from the body of the princely Mañjuśrī touched it.

source: སྨད་འཚོང་མའི་བུ་མོ་གསེར་མཆོག་འོད་དཔལ་གྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལྷའི་བུ་གཞོན་ནུ་ལྟར་འདུག་ལ། ལུས་ལ་རྒྱན་གྱིས་བརྒྱན་ཅིང་གསལ་བའི་གོས་ལེགས་པར་གྱོན་ལ། གོས་དེ་ལས་ཀྱང་འོད་འབྱུང་བར་མཐོང་སྟེ
en: The courtesan’s daughter Suvarṇottama­prabhāśrī saw the princely Mañjuśrī standing there, looking like a god, his body adorned with jewelry and clothed in his shining garment, and she saw too the light emanating from his garment.

source: མཐོང་མ་ཐག་ཏུ་དེ་བདག་གི་ལུས་ལ་བརྙས་པའི་འདུ་ཤེས་དང་། དམན་པའི་འདུ་ཤེས་སྐྱེས་ཤིང་གོས་དེ་ལ་ཡང་མངོན་པར་འདོད་པ་དང་། གཟུང་བའི་འདུ་ཤེས་སྐྱེས་ནས་
en: As soon as she had seen him, a feeling of contempt for her own body, a feeling of inferiority, arose in her, and she wanted to possess his garment.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: She thought,

source: ཚོང་དཔོན་གྱི་བུ་འདིས་ཆོག་གིས་
en: “I have had enough of this banker’s son.

source: བདག་ཤིང་རྟ་འདི་ལས་བབས་ལ་འདི་དང་ལྷན་ཅིག་ཏུ་དགའ་བ་དང་། རྩེ་བ་དང་། དགའ་མགུར་སྤྱད་ལ་
en: I will get down from this carriage to amuse myself with, play with, and tease this man instead.

source: གོས་འདི་ཡང་བསླང་བར་བྱའོ་སྙམ་མོ། །
en: Then I can ask him for his garment.”

source: བུ་མོ་དེས་དེ་ལྟ་བུའི་སེམས་བསྐྱེད་མ་ཐག་ཏུ་དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་བྱིན་གྱིས་བརླབས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུས་བདག་ཉིད་མིའི་གཟུགས་སུ་མངོན་པར་སྤྲུལ་ནས་བུ་མོ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: As soon as the girl had these thoughts, however, the great divine king Vaiśravaṇa, who had transformed himself into a man with the help of the magic of the princely Mañjuśrī, said to her,

source: བུ་མོ་ཁྱོད་སྐྱེས་བུ་དམ་པ་འདི་ལ་ཀུན་དུ་ཆགས་པའི་སེམས་མ་སྐྱེད་ཅིག །
en: “Young lady, do not think passionate thoughts about this good man!

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why not?

source: འདི་ནི་འདོད་པ་དོན་དུ་གཉེར་བ་མ་ཡིན་པའི་ཕྱིར་རོ། །
en: Because he never seeks pleasure.”

source: བུ་མོས་སྨྲས་པ། འདི་སུ་ཞིག་ཡིན། འདིའི་མིང་ཅི།
en: “Who is he? What is his name?” asked the girl.

source: རྣམ་ཐོས་ཀྱི་བུས་སྨྲས་པ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སྟེ། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཞེས་བྱའོ། །
en: “He is a bodhisatva,” Vaiśravaṇa answered, “and he is called the princely Mañjuśrī.”

source: བུ་མོས་སྨྲས་པ། བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་དེ་ཅི་ཞིག་ཡིན།
en: “But what is a bodhisatva?” asked the girl.

source: ཅི་དེ་ལྷའམ། འོན་ཏེ་ཀླུའམ། གནོད་སྦྱིན་ནམ། དྲི་ཟའམ། ལྷ་མ་ཡིན་ནམ། ནམ་མཁའ་ལྡིང་ངམ། མིའམ་ཅིའམ། ལྟོ་འཕྱེ་ཆེན་པོའམ། བརྒྱ་བྱིན་ནམ། ཚངས་པའམ། འཇིག་རྟེན་སྐྱོང་བའམ། རྒྱལ་པོ་ཆེན་པོའམ།
en: “Is it a god, or is it a nāga, a yakṣa, a gandharva, a demigod, a garuḍa, a kiṃnara, a mahoraga, Śakra, Brahmā, a protector of the world, or a great king?

source: བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་དེ་ཅི་ཞིག་ཡིན།
en: What is a bodhisatva?”

source: རྣམ་ཐོས་ཀྱི་བུས་སྨྲས་པ།
en: Vaiśravaṇa replied,

source: བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་དེ་ནི་ལྷ་ཡང་མ་ཡིན། ཀླུ་ཡང་མ་ཡིན། གནོད་སྦྱིན་ཡང་མ་ཡིན། དྲི་ཟ་ཡང་མ་ཡིན། ལྷ་མ་ཡིན་ཡང་མ་ཡིན། ནམ་མཁའ་ལྡིང་ཡང་མ་ཡིན། མིའམ་ཅི་ཡང་མ་ཡིན། ལྟོ་འཕྱེ་ཆེན་པོ་ཡང་མ་ཡིན། བརྒྱ་བྱིན་ཡང་མ་ཡིན། ཚངས་པ་ཡང་མ་ཡིན། འཇིག་རྟེན་སྐྱོང་བ་ཡང་མ་ཡིན། རྒྱལ་པོ་ཆེན་པོ་ཡང་མ་ཡིན་ཏེ།
en: “Young lady, a bodhisatva is not a god, a nāga, a yakṣa, a gandharva, a demigod, a garuḍa, a kiṃnara, a mahoraga, Śakra, Brahmā, a protector of the world, or a great king.

source: བུ་མོ་དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཀུན་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་སྟེ། དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱའོ། །
en: Young lady, he is called a bodhisatva because he completely fulfills the wishes of all beings.

source: འདི་ནི་བསླངས་པ་ཐམས་ཅད་སྦྱིན་པར་བྱེད་དེ། ཡོངས་སུ་མི་གཏོང་བ་ཅི་ཡང་མེད་པས་དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱའོ། །
en: He is called a bodhisatva because he gives to all who ask and does not send anybody away.”

source: དེ་ནས་བུ་མོ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Then the girl thought,

source: དེ་སྐད་གྲག་པ་ལས་ན་འདིས་བདག་ལ་གོས་འདི་སྦྱིན་པར་འགྱུར་རོ་
en: “So, according to what I've been told, Mañjuśrī will give me his garment.”

source: དེ་ནས་སྨད་འཚོང་མའི་བུ་མོ་གསེར་མཆོག་འོད་དཔལ་ཤིང་རྟ་དེ་ལས་བབས་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: After the courtesan’s daughter Suvarṇottama­prabhāśrī had alighted from the carriage, she spoke to the princely Mañjuśrī:

source: འཇམ་དཔལ་གང་ཁྱོད་ཀྱི་སྐུ་ལ་གསོལ་བའི་ན་བཟའ་འདི་བདག་ལ་སྩལ་དུ་གསོལ།
en: “Mañjuśrī, please give me the garment in which your body is clothed.”

source: དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་ཡང་སྨྲས་སོ། །
en: She then spoke the following verse:

source: གལ་ཏེ་ཁྱོད་ནི་བྱང་ཆུབ་ལ་ཡང་ཞུགས་གྱུར་ན། །འཇམ་དབྱངས་ན་བཟའ་འདི་ནི་བདག་ལ་སྩལ་དུ་གསོལ། །
en: “If you have entered awakening, Mañjughoṣa, Please give me this garment.

source: སེར་སྣ་ཅན་གྱི་བྱང་ཆུབ་སེམས་དཔའ་མི་མཛེས་ཏེ། །དཔེར་ན་ཆབ་དང་བྲལ་ཞིང་སྐམས་པའི་ཀླུང་དང་མཚུངས། །
en: An ungenerous bodhisatva is not attractive. He is like a dry river with no water.”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ།
en: Mañjuśrī replied,

source: གལ་ཏེ་བུ་མོ་ཁྱོད་ནི་བྱང་ཆུབ་ཞུགས་གྱུར་ན། །ཁོ་བོས་དེ་རིང་གོས་འདི་ཁྱོད་ལ་སྦྱིན་པར་བྱ། །གང་དག་གཡོ་བ་མེད་པར་བྱང་ཆུབ་སེམས་ལ་གནས། །དེ་དག་འདི་ན་ལྷར་བཅས་འཇིག་རྟེན་མཆོད་འོས་ཡིན། །
en: “If you enter awakening, young lady, I will give you this garment right away, because the whole world with its gods considers those who unswervingly maintain the mind of awakening to be worthy of offerings.”

source: བུ་མོས་སྨྲས་པ།
en: The girl then asked the following in verse:

source: བྱང་ཆུབ་ཅེས་བགྱི་ཚིག་གི་དོན་ནི་གང་ཞིག་ལགས། །
en: “So what, then, is the meaning of the word awakening?

source: དེ་ནི་གང་ལས་འཐོབ་ཅིང་
en: From whom is it attained?

source: སུ་ཞིག་སྩལ་བར་བགྱིད། །
en: Who will grant it?

source: ཚོགས་རྣམས་གང་དག་ལ་ནི་ངེས་པར་བསྟེན་བགྱིས་ན
en: In which religious groups is it taught?

source: མཁས་པ་མ་ལགས་མ་རྟོགས་རྣམས་ཀྱིས་རྟོགས་པར་འགྱུར། །
en: Let those who are not clever, those without understanding, understand!”

source: སྲིང་མོ་བརྗོད་པ་མེད་པ་དང་། ཡི་གེ་མེད་པ་དང་། ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་དག་ལས་རྣམ་པར་གྲོལ་བ་དང་། སྟོང་པ་དང་། མཚན་མ་དག་དང་བྲལ་བ་དང་། ཉོན་མོངས་པ་མེད་པ་དང་། ཞི་བ་དང་། རབ་ཏུ་ཞི་བ་དང་། ཉེ་བར་ཞི་བ་ནི་བྱང་ཆུབ་ཅེས་བྱའོ། །
en: “Sister, awakening refers to the inexpressible, the absence of letters, the freedom from the aggregates, the sensory elements, and the sense sources, emptiness, the freedom from marks, the absence of afflictions, peace, tranquility, and complete pacification.”

source: ཡང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བུ་མོ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The princely Mañjuśrī continued,

source: སྲིང་མོ་ཁྱོད་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིག་དང་། ངས་ཁྱོད་ལ་གོས་འདི་སྦྱིན་ནོ། །
en: “Sister, if you develop the mind of awakening, then I will give you this garment.”

source: བུ་མོས་སྨྲས་པ། འཇམ་དཔལ་བྱང་ཆུབ་ཅེས་བགྱི་བ་དེ་གང་ལགས།
en: “What is awakening , Mañjuśrī?” asked the girl.

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། སྲིང་མོ་ཁྱོད་ཉིད་བྱང་ཆུབ་ཡིན་ནོ། །
en: “Sister,” replied Mañjuśrī, “you yourself are awakening.”

source: བུ་མོས་སྨྲས་པ། འཇམ་དཔལ་ཁྱོད་ཀྱིས་གསུངས་པའི་དོན་དེ་བདག་གིས་མ་འཚལ་ན་ཇི་ལྟར་བདག་བྱང་ཆུབ་ལགས།
en: “How am I awakening, Mañjuśrī?” asked the girl. “I don’t understand the meaning of what you have said.”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། སྲིང་མོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་ཞིག་བཞུགས་པ་དེ་འདི་སྐད་དུ།
en: “Sister,” replied Mañjuśrī, “this is the Dharma teaching of the current Tathāgata, the worthy one, the perfectly awakened one named Śākyamuni:

source: འདི་ལྟར་ལུས་མཉམ་པ་ཉིད་ཀྱིས་བྱང་ཆུབ་མཉམ་པ་ཉིད་དོ། །
en: ‘Just as the body partakes in universal sameness, awakening too partakes in universal sameness.

source: བྱང་ཆུབ་མཉམ་པ་ཉིད་ཀྱིས་ལུས་མཉམ་པ་ཉིད་དོ་ཞེས་ཆོས་སྟོན་ཏེ།
en: Just as awakening partakes in universal sameness, the body too partakes in universal sameness.’

source: སྲིང་མོ་དེའི་ཕྱིར་ངས་ཁྱོད་ལ་འདི་སྐད་དུ་ཁྱོད་ཉིད་བྱང་ཆུབ་བོ་ཞེས་སྨྲས་སོ། །
en: Therefore, I say to you, sister: ‘You yourself are awakening.’

source: སྲིང་མོ་འདི་ཇི་སྙམ་དུ་སེམས།
en: What is your opinion, sister?

source: ཁྱོད་ཀྱི་ལུས་འདི་ལ་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་མངོན་པར་གྲུབ་པ་ཡོད་དམ།
en: Is this body of yours made up of the aggregates, the sensory elements, and the sense sources?”

source: དེ་ནས་བུ་མོ་དེས་བསྟན་པ་འདི་ཐོས་ནས་དེ་སྔོན་གྱི་དགེ་བའི་རྩ་བའི་རྒྱུ་འཐུན་པས་ཆོས་ལ་སྣང་བ་སྐྱེས་པར་གྱུར་ཏེདེས་སྣང་བ་ཐོབ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: When the girl had heard this teaching, the light of the Dharma was born in her as the result of the roots of virtue she had previously developed, and when she had attained that light, she said to Mañjuśrī,

source: འཇམ་དཔལ་དེ་ནི་དེ་ལྟ་ལགས་ཏེ། བདག་གི་ལུས་འདི་ལ་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་དག་མངོན་པར་གྲུབ་པ་མ་ལགས་སོ། །
en: “Just so, Mañjuśrī, this body of mine is made up of the aggregates, the sensory elements, and the sense sources.”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། སྲིང་མོ་འདི་ཇི་སྙམ་དུ་སེམས།
en: “What is your opinion, sister?” asked Mañjuśrī.

source: གཟུགས་ལ་སེམས་པའམ། རྣམ་པར་ཤེས་པ་ཡོད་དམ།
en: “Does form have mental activity or consciousness?”

source: བུ་མོས་སྨྲས་པ། འཇམ་དཔལ་དེ་ནི་མ་མཆིས་སོ། །
en: “Not at all, Mañjuśrī,” replied the girl.

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། སྲིང་མོ་བྱང་ཆུབ་ཀྱང་མི་སེམས་ཤིང་རྣམ་པར་ཤེས་པ་མེད་དེ།
en: “Awakening too, sister, has no mental activity or consciousness,” said Mañjuśrī.

source: སྲིང་མོ་དེའི་ཕྱིར་གཟུགས་མཉམ་པ་ཉིད་ཀྱིས་བྱང་ཆུབ་མཉམ་པ་ཉིད་དོ། །
en: “Therefore, sister, just as form partakes in universal sameness, awakening too partakes in universal sameness.

source: བྱང་ཆུབ་མཉམ་པ་ཉིད་ཀྱིས་གཟུགས་མཉམ་པ་ཉིད་དེ།
en: Just as awakening partakes in universal sameness, form too partakes in universal sameness.

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལ་སེམས་པའམ། རྣམ་པར་ཤེས་པ་ཡོད་དམ།
en: Do feelings, perception, conditioning, or consciousness have mental activity or consciousness?”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། སྲིང་མོ་བྱང་ཆུབ་ཀྱང་མི་སེམས་ཤིང་རྣམ་པར་ཤེས་པ་མི་སེམས་སོ། །
en: “Awakening too, sister, has no mental activity or consciousness,” said Mañjuśrī.

source: སྲིང་མོ་དེའི་ཕྱིར་རྣམ་པར་ཤེས་པ་མཉམ་པ་ཉིད་ཀྱིས་བྱང་ཆུབ་མཉམ་པ་ཉིད་དོ། །
en: “Therefore, sister, just as consciousness partakes in universal sameness, awakening too partakes in universal sameness.

source: བྱང་ཆུབ་མཉམ་པ་ཉིད་ཀྱིས་རྣམ་པར་ཤེས་པ་མཉམ་པ་ཉིད་དེ།
en: Just as awakening partakes in universal sameness, consciousness too partakes in universal sameness.

source: སྲིང་མོ་གཞན་ཡང་གཟུགས་ནང་ངམ། ཕྱི་རོལ་ལམ། གཉི་ག་མེད་པར་རམ། གཟུགས་འདི་སྔོན་པོའམ། སེར་པོའམ། དམར་པོའམ། དཀར་པོའམ། ལེ་བརྒན་ནམ། ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་གམ། ཡུལ་ན་གནས་པའམ། ཕྱོགས་ན་གནས་པ་ཞེས་བསྟན་པར་ནུས་སམ།
en: Mañjuśrī then asked, “What, sister, is your opinion? Is form something inner or outer, or is it both? Is form blue, yellow, red, or white? Is it the color of saffron, crystal, or silver? Can it be shown to be found in any place or direction?”

source: བུ་མོས་སྨྲས་པ། འཇམ་དཔལ་དེ་ནི་མ་ལགས་སོ། །
en: “Not at all, Mañjuśrī,” replied the girl.

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། སྲིང་མོ་བྱང་ཆུབ་ཀྱང་ནང་ངམ། ཕྱི་རོལ་ལམ། གཉི་ག་མེད་པར་རམ། བྱང་ཆུབ་དེ་སྔོན་པོའམ། སེར་པོའམ། དམར་པོའམ། དཀར་པོའམ། ལེ་བརྒན་ནམ། ཤེལ་དང་དངུལ་གྱི་ཁ་དོག་གམ། ཡུལ་ན་གནས་པའམ། ཕྱོགས་ན་གནས་པ་ཞེས་བསྟན་པར་མི་ནུས་ཏེ
en: “Awakening too, sister, is not something inner or outer, or both,” said Mañjuśrī. “It is not blue, yellow, red, or white; it does not have the color of saffron, crystal, or silver; and it cannot be shown to be found in any place or direction.

source: སྲིང་མོ་དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ནང་ངམ། ཕྱི་རོལ་ལམ། གཉི་ག་མེད་པར་རམ། རྣམ་པར་ཤེས་པ་འདི་སྔོན་པོའམ། སེར་པོའམ། དམར་པོའམ། དཀར་པོའམ། ལེ་བརྒན་ནམ། ཤེལ་དང་དངུལ་གྱི་ཁ་དོག་གམ། ཡུལ་ན་གནས་པའམ། ཕྱོགས་ན་གནས་པ་ཞེས་བསྟན་པར་ནུས་སམ།
en: “Likewise, sister, are feelings, perception, conditioning, and consciousness inner or outer, or are they both? Is consciousness blue, yellow, red, or white? Is it the color of saffron, crystal, or silver? Can it be shown to be found in any place or direction?”

source: སྲིང་མོ་དེའི་རྣམ་པར་ཤེས་པ་མཉམ་པ་ཉིད་ཀྱིས་བྱང་ཆུབ་མཉམ་པ་ཉིད་དོ། །
en: Therefore, sister, just as consciousness partakes in universal sameness, awakening too partakes in universal sameness.

source: སྲིང་མོ་གཞན་ཡང་ཕུང་པོ་ལྔ་ནི་སྒྱུ་མ་ལྟ་བུ་སྟེ།
en: “Further, sister, the five aggregates are like a magical creation.

source: ཡོད་པ་མ་ཡིན་པ།
en: They are nonexistent.

source: ཕྱིན་ཅི་ལོག་ལས་སྐྱེས་ཤིང་ཡོད་པ་མ་ཡིན་པ།
en: They arise from misunderstanding and are nonexistent.

source: ཕྱིན་ཅི་ལོག་གིས་ཐ་སྙད་བཏགས་པའོ། །
en: They are an erroneous conventional expression.

source: བྱང་ཆུབ་ཀྱང་སྒྱུ་མ་ལྟ་བུ་སྟེ།
en: Awakening too is like a magical creation,

source: ཡོད་པ་མ་ཡིན་པ་ཕྱིན་ཅི་ལོག་གིས་ཐ་སྙད་བཏགས་པ་སྟེ།
en: nothing but a nonexistent and misleading conventional expression.

source: སྲིང་མོ་དེའི་ཕྱིར་སྒྱུ་མ་མཉམ་པ་ཉིད་ཀྱིས་ཕུང་པོ་མཉམ་པ་ཉིད་དོ། །
en: Therefore, sister, just as a magical creation partakes in universal sameness, the aggregates partake in universal sameness.

source: ཕུང་པོ་མཉམ་པ་ཉིད་ཀྱིས་སྒྱུ་མཉམ་པ་ཉིད་དོ། །
en: Just as the aggregates partake in universal sameness, a magical creation partakes in universal sameness.

source: སྒྱུ་མཉམ་པ་ཉིད་ཀྱིས་བྱང་ཆུབ་མཉམ་པ་ཉིད་དོ། །
en: Just as a magical creation partakes in universal sameness, awakening partakes in universal sameness.

source: བྱང་ཆུབ་མཉམ་པ་ཉིད་ཀྱིས་སྒྱུ་མ་མཉམ་པ་ཉིད་དེ།
en: Just as awakening partakes in universal sameness, a magical creation partakes in universal sameness.

source: སྲིང་མོ་གཞན་ཡང་ཕུང་པོ་ལྔ་ནི་རྨི་ལམ་ལྟ་བུ་སྟེ། ཤིན་ཏུ་མངོན་པར་མ་གྲུབ་པའོ། །
en: “Further, sister, the five aggregates are like a dream, which is not really happening.

source: བྱང་ཆུབ་ཀྱང་རྨི་ལམ་གྱི་རང་བཞིན་ཡིན་པས་ཤིན་ཏུ་མངོན་པར་མ་གྲུབ་པ་སྟེ།
en: Awakening too has the nature of a dream, which is not really happening.

source: སྲིང་མོ་དེའི་ཕྱིར་རྨི་ལམ་མཉམ་པ་ཉིད་ཀྱིས་ཕུང་པོ་མཉམ་པ་ཉིད་དོ། །
en: Therefore, sister, just as a dream partakes in universal sameness, the aggregates partake in universal sameness.

source: ཕུང་པོ་མཉམ་པ་ཉིད་ཀྱིས་རྨི་ལམ་མཉམ་པ་ཉིད་དོ། །
en: Just as the aggregates partake in universal sameness, a dream partakes in universal sameness.

source: རྨི་ལམ་མཉམ་པ་ཉིད་ཀྱིས་བྱང་ཆུབ་མཉམ་པ་ཉིད་དོ། །
en: Just as a dream partakes in universal sameness, awakening partakes in universal sameness.

source: བྱང་ཆུབ་མཉམ་པ་ཉིད་ཀྱིས་རྨི་ལམ་མཉམ་པ་ཉིད་དེ།
en: Just as awakening partakes in universal sameness, a dream partakes in universal sameness.

source: སྲིང་མོ་གཞན་ཡང་ཕུང་པོ་ལྔ་ནི་སྨིག་རྒྱུ་ལྟ་བུ་སྟེ། འཁྲུལ་པའི་ལས་ཀྱིས་བསྐྱེད་པའོ། །
en: “Further, sister, the five aggregates are like a mirage, which is brought about by illusory action.

source: བྱང་ཆུབ་ཀྱང་སྨིག་རྒྱུའི་རང་བཞིན་ཏེ། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མེད་པའོ། །
en: Awakening too has the nature of a mirage, as it is beyond the maturation of action.

source: སྲིང་མོ་དེའི་ཕྱིར་སྨིག་རྒྱུ་མཉམ་པ་ཉིད་ཀྱིས་ཕུང་པོ་མཉམ་པ་ཉིད་དོ། །
en: Therefore, sister, just as a mirage partakes in universal sameness, the aggregates partake in universal sameness.

source: ཕུང་པོ་མཉམ་པ་ཉིད་ཀྱིས་སྨིག་རྒྱུ་མཉམ་པ་ཉིད་དོ། །
en: Just as the aggregates partake in universal sameness, a mirage partakes in universal sameness.

source: སྨིག་རྒྱུ་མཉམ་པ་ཉིད་ཀྱིས་བྱང་ཆུབ་མཉམ་པ་ཉིད་དོ། །
en: Just as a mirage partakes in universal sameness, awakening partakes in universal sameness.

source: བྱང་ཆུབ་མཉམ་པ་ཉིད་ཀྱིས་སྨིག་རྒྱུ་མཉམ་པ་ཉིད་དེ།
en: Just as awakening partakes in universal sameness, a mirage partakes in universal sameness.

source: སྲིང་མོ་གཞན་ཡང་ཕུང་པོ་ལྔ་ནི་གཟུགས་བརྙན་ལྟ་བུ་སྟེ། འཕོ་བ་མེད་པའོ། །
en: “Further, sister, the five aggregates are like reflections in a mirror: they do not change as long as the object that is mirrored is not changed.
